### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
purchase = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(purchase)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [2]:
df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [3]:
df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

* Display the total number of players

In [4]:
total = len(df["SN"].value_counts())
pd.DataFrame([total], columns = ["Total Players"])

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
unique = len(df['Item ID'].value_counts())
average = df['Price'].mean()
total_purchases = df['Purchase ID'].count()
revenue = df['Price'].sum()

analysis = pd.DataFrame({"Number of Unique Items": [unique], "Total Purchases": [total_purchases],  "Average Price": [average], "Total Revenue": [revenue]})
analysis

   Average Price  Number of Unique Items  Total Purchases  Total Revenue
0       3.050987                     183              780        2379.77

In [6]:
analysis = analysis[["Number of Unique Items", "Average Price","Total Purchases", "Total Revenue"]]
analysis

   Number of Unique Items  Average Price  Total Purchases  Total Revenue
0                     183       3.050987              780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [39]:
unique = df.groupby(["Gender"]).nunique()
gender_total = unique["SN"].sum()

male = df[df["Gender"] == "Male"]["SN"].nunique()
female = df[df["Gender"] == "Female"]["SN"].nunique()
other = df[df["Gender"] == "Other / Non-Disclosed"]["SN"].nunique()

maleprc = float(male)/ total * 100
femaleprc = float(female)/ total * 100
otherprc = float(other)/ total * 100

gender_df = pd.DataFrame({"Gender": ["Female", "Male", "Other / Non-Disclosed"], "Percentage of Players": [femaleprc, maleprc, otherprc],
                                        "Total Players": [female, male, other]})
gender_df

                  Gender  Percentage of Players  Total Players
0                 Female              14.062500             81
1                   Male              84.027778            484
2  Other / Non-Disclosed               1.909722             11


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [40]:
female_purchase = df[df["Gender"] == "Female"]["Purchase ID"].count()
male_purchase = df[df["Gender"] == "Male"]["Purchase ID"].count() 
other_purchase = df[df["Gender"] == "Other / Non-Disclosed"]["Purchase ID"].count()

female_ave = df[df["Gender"] == "Female"]["Price"].mean()
male_ave = df[df["Gender"] == "Male"]["Price"].mean()
other_ave = df[df["Gender"] == "Other / Non-Disclosed"]["Price"].mean()

female_total = df[df["Gender"] == "Female"]["Price"].sum()
male_total = df[df["Gender"] == "Male"]["Price"].sum()
other_total = df[df["Gender"] == "Other / Non-Disclosed"]["Price"].sum()

#avg. purchase total per person by gender
female_avtot = female_total/female
male_avtot = male_total/male
other_avtot = other_total/other

purchase_df = pd.DataFrame({"Gender": ["Female", "Male", "Other / Non-Disclosed"], "Purchase Count": [female_purchase, male_purchase, other_purchase],
                                        "Average Purchase Price": [female_ave, male_ave, other_ave], "Total Purchase Value": [female_total, male_total, other_total],
                                "Average Purchase Total per Person by Gender": [female_avtot, male_avtot, other_avtot]}, columns =["Gender", "Purchase Count", "Average Purchase Price", "Total Purchase Value", "Average Purchase Total per Person by Gender"])

purchase_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [48]:
nodup_df = df.drop_duplicates("SN")

bins = [0,9,14,19,24,29,34,39,99]

group_names = ["<10", "10-14", "15-19", "20-24",
               "25-29", "30-34", "35-39", "40+"]

nodup_df["Age Ranges"] = pd.cut(nodup_df["Age"], bins, labels=group_names)

age_df = nodup_df.groupby(["Age Ranges"])

C:\Users\coban\Anaconda2\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

In [52]:
age_purchase = nodup_df["Age Ranges"].value_counts()
ageprc = (age_purchase/ total) * 100
demographics = pd.DataFrame({"Total Purchase": age_purchase,
                             "Percentage of Players":ageprc})
demographics = demographics.reindex(["<10", "10-14", "15-19", "20-24",
                                     "25-29", "30-34", "35-39", "40+"])

demographics

       Percentage of Players  Total Purchase
<10                 2.951389              17
10-14               3.819444              22
15-19              18.576389             107
20-24              44.791667             258
25-29              13.368056              77
30-34               9.027778              52
35-39               5.381944              31
40+                 2.083333              12

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [53]:
#Bin the purchase_data data frame by age ,, for this, age_df
#age_purchase(for purchase count)

age_ave_price = age_df["Price"].mean()

age_tot_purchase = age_df["Price"].sum()

age_ave_tot = age_tot_purchase / age_purchase

age_analysis = pd.DataFrame({"Purchase Count": age_purchase,
                             "Average Purchase Price": age_ave_price,
                            "Total Purchase Value":age_tot_purchase,
                            "Avg Total Purchase per Person": age_ave_tot})
age_analysis

,Average Purchase Price,Avg Total Purchase per Person,Purchase Count,Total Purchase Value
10-14,3.074545,3.074545,22,67.64
15-19,3.101682,3.101682,107,331.88
20-24,3.063527,3.063527,258,790.39
25-29,2.908182,2.908182,77,223.93
30-34,2.921538,2.921538,52,151.92
35-39,3.510000,3.510000,31,108.81
40+,3.037500,3.037500,12,36.45
<10,3.390000,3.390000,17,57.63

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80